#include "character.h"

vector<string> ClassesVector =
{
	"Бард",
	"Варвар",
	"Воин",
	"Волшебник",
	"Друид",
	"Жрец",
	"Изобретатель",
	"Колдун",
	"Монах",
	"Паладин",
	"Плут",
	"Следопыт",
	"Чародей"
};

vector<string> RacesVector =
{
	"Гном",
	"Дварф",
	"Драконороженный",
	"Полуорк",
	"Полурослик",
	"Полуэльф",
	"Тифлинг",
	"Человек",
	"Эльф"
};

vector<string> BackgroundsVector =
{
	"Артист",
	"Беспризорник",
	"Благородный",
	"Гильдейский ремесленник",
	"Моряк",
	"Мудрец",
	"Народный герой",
	"Отшельний",
	"Пират",
	"Преступник",
	"Прислужник",
	"Солдат",
	"Чужеземец",
	"Шарлатан"
};

void Character::PrintInfo()
{
	// Header
	cout << "Имя персонажа: " << name << "\t\t Класс: " << charClass << " Предыстория: " << background << " Имя игрока:" << playerName << endl;
	cout << "\t\t" << "Раса: " << race << " Мировоззрение: " << worldview << " Опыт: " << experience << " Уровень: " << level << endl << endl;

	// Left part of character's list

}